Fontys-engineering/Radar_software/Dependencies/mmwave_mcuplus_sdk_04_07_02_01/ti/datapath/dpu/rangecfarprocDDMA/test/dsstest_awr2x44P.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AWR2X44P" --package "LOP" --part "Default" --context "c66ss0" --product "MCU_PLUS_SDK_AWR2X44P@09.02.00"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const edma      = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1     = edma.addInstance();
const hwa       = scripting.addModule("/drivers/hwa/hwa", {}, false);
const hwa1      = hwa.addInstance();
const cache_c6x = scripting.addModule("/kernel/dpl/cache_c6x");
const debug_log = scripting.addModule("/kernel/dpl/debug_log");

/**
 * Write custom configuration values to the imported modules.
 */
edma1.$name                       = "CONFIG_EDMA0";
edma1.instance                    = "EDMA_DSS_A";
edma1.enableOwnQdmaChannelConfig  = false;
edma1.enableReservedChannelConfig = false;
edma1.edmaRmDmaCh[0].$name        = "CONFIG_EDMA_RM0";
edma1.edmaRmDmaCh[0].resourceType = scripting.forceWrite("ownDmaCh");
edma1.edmaRmDmaCh[0].endIndex     = 63;
edma1.edmaRmTcc[0].$name          = "CONFIG_EDMA_RM2";
edma1.edmaRmTcc[0].endIndex       = 63;
edma1.edmaRmParam[0].$name        = "CONFIG_EDMA_RM3";
edma1.edmaRmParam[0].endIndex     = 127;

hwa1.$name = "CONFIG_HWA0";

cache_c6x.marRegionConfig.create(2);
cache_c6x.marRegionConfig[0].$name          = "kernel_dpl_cache_c6x_mar0";
cache_c6x.marRegionConfig[0].baseAddr       = 0xC5000000;
cache_c6x.marRegionConfig[1].$name          = "kernel_dpl_cache_c6x_mar1";
cache_c6x.marRegionConfig[1].baseAddr       = 0x88000000;
cache_c6x.marRegionConfig[1].enablePrefetch = true;
